[
    {
        "id": "requirements_analyst",
        "title": "Phân tích yêu cầu",
        "icon": "/FE/assets/images/pages/Vector-headp.svg",
        "image": "/FE/assets/images/pages/nb-requirements_analysis/content.svg",
        "seperator": "/FE/assets/images/pages/cloud.svg",
        "firsttitle": "Phân tích yêu cầu",
        "firstdesc": "#",
        "secondtitle": "#",
        "seconddesc": "#"
    },
    {
        "id": "ui-ux",
        "title": "Thiết kế hệ thống và giao diện",
        "icon": "/FE/assets/images/pages/Vector-ui-ux.svg",
        "image": "/FE/assets/images/pages/nb-ui-ux/content1.svg",
        "seperator": "/FE/assets/images/pages/cloud.svg",
        "firsttitle": "UI là gì",
        "firstdesc": "#",
        "secondtitle": "UX là gì",
        "seconddesc": "#"
    },
    {
        "id": "developer",
        "title": "Developer",
        "icon": "/FE/assets/images/pages/developer/Vector.svg",
        "image": "/FE/assets/images/pages/developer/content.svg",
        "seperator": "",
        "firsttitle": "Developer là gì?",
        "firstdesc": "Định nghĩa:Là chuyên gia thiết kế, lập trình và bảo trì phần mềm, website; chịu trách nhiệm biến yêu cầu nghiệp vụ hoặc ý tưởng sản phẩm thành mã nguồn có thể vận hành được. Developer có thể làm việc ở nhiều mảng như Frontend, Backend, Fullstack, Android, hoặc iOS, tùy vào nền tảng và công nghệ phát triển. <br>Mục tiêu cốt lõi: Tạo ra sản phẩm phần mềm ổn định, tối ưu và dễ sử dụng, đáp ứng đúng nhu cầu người dùng và mục tiêu kinh doanh, đồng thời đảm bảo khả năng mở rộng, bảo trì và tích hợp trong tương lai.",
        "secondtitle": "#",
        "seconddesc": "#"
    },
    {
        "id": "tester",
        "title": "Kiểm thử  ",
        "icon": "/FE/assets/images/pages/Vector-check.svg",
        "image": "/FE/assets/images/pages/nb-tester/content.svg",
        "seperator": "/FE/assets/images/pages/cloud.svg",
        "firsttitle": "Kiểm thử là gì",
        "firstdesc": "#",
        "secondtitle": "#",
        "seconddesc": "#"
    },
    {
        "id": "deploy",
        "title": "Triển khai",
        "icon": "/FE/assets/images/pages/Vector-code.svg",
        "image": "/FE/assets/images/pages/nb-deploy/content.svg",
        "seperator": "/FE/assets/images/pages/cloud.svg",
        "firsttitle": "Triển khai là gì",
        "firstdesc": "#",
        "secondtitle": "#",
        "seconddesc": "#"
    },
    {
        "id": "ops-security",
        "title": "Giám sát & Bảo trì",
        "icon": "/FE/assets/images/pages/Vector-p.svg",
        "image": "/FE/assets/images/pages/nb-ops-security/content1.svg",
        "seperator": "/FE/assets/images/pages/cloud.svg",
        "firsttitle": "Ops là gì",
        "firstdesc": "#",
        "secondtitle": "Security là gì",
        "seconddesc": "#"
    },
    {
        "id": "collect-improve",
        "title": "Thu thập và cải tiến",
        "icon": "/FE/assets/images/pages/Vector-leaf.svg",
        "image": "/FE/assets/images/pages/nb-collect-improve/content.svg",
        "seperator": "/FE/assets/images/pages/cloud.svg",
        "firsttitle": "Thu thập và cải tiến là gì",
        "firstdesc": "#",
        "secondtitle": "#",
        "seconddesc": "#"
    },
    {
        "id": "devops",
        "title": "DevOps Engineer",
        "icon": "/FE/assets/images/pages/dev_ops/Vector.svg",
        "image": "/FE/assets/images/pages/dev_ops/content.svg",
        "seperator": "",
        "firsttitle": "DevOps Engineer là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia kỹ thuật chịu trách nhiệm tự động hóa và tối ưu hóa các quy trình trong toàn bộ vòng đời phát triển phần mềm, từ code đến triển khai và vận hành. <br>Mục tiêu cốt lõi: Tăng tốc độ, tần suất và độ tin cậy của việc phát hành phần mềm. Đảm bảo sự hợp tác liền mạch giữa đội ngũ Phát triển (Dev) và Vận hành (Ops) thông qua tự động hóa và quản lý cơ sở hạ tầng.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "software_tester",
        "title": "Software Tester",
        "icon": "/FE/assets/images/pages/software_tester/Vector.svg",
        "image": "/FE/assets/images/pages/software_tester/content.svg",
        "seperator": "",
        "firsttitle": "Software Tester là gì?",
        "firstdesc": "Định nghĩa: Là người chuyên nghiệp chịu trách nhiệm kiểm tra, đánh giá và xác minh chất lượng của một sản phẩm phần mềm. <br>Mục tiêu cốt lõi: Phát hiện, ghi nhận và đảm bảo khắc phục lỗi để xác nhận phần mềm hoạt động đúng chức năng, ổn định, hiệu suất cao và đáp ứng tiêu chuẩn chất lượng trước khi đến tay người dùng.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "software_engineer",
        "title": "Software Engineer",
        "icon": "/FE/assets/images/pages/software_engineer/Vector.svg",
        "image": "/FE/assets/images/pages/software_engineer/content.svg",
        "seperator": "",
        "firsttitle": "Software Engineer là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia thiết kế, phát triển và bảo trì phần mềm bằng cách áp dụng nguyên lý kỹ thuật, mô hình và quy trình chuẩn trong phát triển phần mềm. Họ chịu trách nhiệm biến yêu cầu của người dùng thành hệ thống phần mềm hoàn chỉnh, đảm bảo tính logic, ổn định và khả năng mở rộng. Đây là vị trí rất đặc biệt do nó đòi hỏi người làm phải có skillset đáp ứng đầy đủ các giai đoạn trong mô hình SDLC và cũng vì thế mà thường được trả lương cao hơn. <br>Mục tiêu cốt lõi:Tạo ra phần mềm chất lượng cao, hiệu năng tốt, đáp ứng đúng yêu cầu kỹ thuật và nghiệp vụ, đồng thời dễ bảo trì và mở rộng trong tương lai; qua đó góp phần nâng cao năng suất, độ tin cậy và tính bền vững của sản phẩm công nghệ.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "product_owner",
        "title": "Product Owner",
        "icon": "/FE/assets/images/pages/product_owner/Vector.svg",
        "image": "/FE/assets/images/pages/product_owner/content.svg",
        "seperator": "",
        "firsttitle": "Product Owner là gì?",
        "firstdesc": "Định nghĩa: Chịu trách nhiệm giải quyết các vấn đề thực tế của người dùng khi họ sử dụng sản phẩm. Đồng thời, PO vận hành, cải tiến và tối ưu hóa sản phẩm để đạt được mục tiêu kinh doanh của công ty. <br>Mục tiêu cốt lõi:Đảm bảo sản phẩm phần mềm phù hợp với nhu cầu người dùng, mục tiêu kinh doanh và tầm nhìn chiến lược, bằng cách quản lý Product Backlog, ưu tiên tính năng hợp lý và phối hợp chặt chẽ với nhóm kỹ thuật để đưa ra quyết định đúng đắn, kịp thời trong quá trình phát triển.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "system_analyst",
        "title": "System Analyst",
        "icon": "/FE/assets/images/pages/system_analyst/Vector.svg",
        "image": "/FE/assets/images/pages/system_analyst/content.svg",
        "seperator": "",
        "firsttitle": "System Analyst là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia CNTT chịu trách nhiệm phân tích, thiết kế và triển khai các hệ thống thông tin. Họ đánh giá xem hệ thống có đáp ứng được mục tiêu đề ra hay không, đồng thời làm việc với người dùng cuối, nhà cung cấp phần mềm và lập trình viên để đạt kết quả tốt nhất. Nhà phân tích hệ thống sử dụng các kỹ thuật phân tích và thiết kế để giải quyết vấn đề kinh doanh bằng công nghệ, đồng thời đóng vai trò là người thúc đẩy thay đổi,  thiết kế hệ thống cho những thay đổi đó và hướng dẫn người khác sử dụng hệ thống hiệu quả. <br>Mục tiêu cốt lõi:Đảm bảo phần mềm được thiết kế đúng mục đích, phù hợp với nhu cầu thực tế, và dễ triển khai – dễ bảo trì. Nói cách khác, họ giúp “xây đúng thứ cần xây”, chứ không chỉ “xây đúng cách”.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "ai_engineer",
        "title": "AI Engineer",
        "icon": "/FE/assets/images/pages/ai_engineer/Vector.svg",
        "image": "/FE/assets/images/pages/ai_engineer/content.svg",
        "seperator": "",
        "firsttitle": "AI  Engineer là gì?",
        "firstdesc": "Định nghĩa: Là người chịu trách nhiệm thiết kế, huấn luyện, và tích hợp các mô hình Học máy và Học sâu vào sản phẩm phần mềm để tạo ra các tính năng thông minh và tự động. <br>Mục tiêu cốt lõi: Đảm bảo mô hình AI được triển khai thành công vào môi trường sản xuất, hoạt động ổn định và có thể mở rộng.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "cyber_security_engineer",
        "title": "Cybersecuirty Engineer",
        "icon": "/FE/assets/images/pages/cyber_secuirty_specialist/Vector.svg",
        "image": "/FE/assets/images/pages/cyber_secuirty_specialist/content.svg",
        "seperator": "",
        "firsttitle": "Cybersecuirty Engineer là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia chịu trách nhiệm thiết kế, triển khai và duy trì các biện pháp bảo mật nhằm bảo vệ hệ thống, mạng và dữ liệu của tổ chức khỏi các cuộc tấn công mạng, truy cập trái phép hoặc rò rỉ thông tin. <br>Mục tiêu cốt lõi: Đảm bảo tính bảo mật (confidentiality), tính toàn vẹn (integrity) và tính sẵn sàng (availability) của hệ thống thông tin, qua đó ngăn chặn, phát hiện và ứng phó hiệu quả với các mối đe dọa an ninh mạng, giúp doanh nghiệp vận hành an toàn và bền vững trong môi trường số.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "cloud_engineer",
        "title": "Cloud Engineer",
        "icon": "/FE/assets/images/pages/cloud_engineer/Vector.svg",
        "image": "/FE/assets/images/pages/cloud_engineer/content.svg",
        "seperator": "",
        "firsttitle": "Cloud Engineer là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia thiết kế, xây dựng, triển khai và quản lý cơ sở hạ tầng và dịch vụ trên các nền tảng điện toán đám mây công cộng (như AWS, Azure, GCP). <br>Mục tiêu cốt lõi: Đảm bảo hệ thống được triển khai trên đám mây hiệu quả, bảo mật, có khả năng mở rộng và được tối ưu hóa chi phí. Chuyển đổi quy trình vận hành truyền thống sang môi trường đám mây tự động.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "game_developer",
        "title": "Game Developer",
        "icon": "/FE/assets/images/pages/game_developer/Vector.svg",
        "image": "/FE/assets/images/pages/game_developer/content.svg",
        "seperator": "",
        "firsttitle": "Game Developer là gì?",
        "firstdesc": "Định nghĩa: Là người chuyên nghiệp chịu trách nhiệm viết code và lập trình các tính năng, cơ chế chơi (gameplay) và logic của trò chơi điện tử. <br>Mục tiêu cốt lõi: Biến các ý tưởng thiết kế (design) thành sản phẩm game có thể chơi được, đảm bảo trò chơi hoạt động ổn định, có hiệu suất cao và mang lại trải nghiệm thú vị cho người chơi.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "blockchain_developer",
        "title": "Blockchain Developer",
        "icon": "/FE/assets/images/pages/blockchain_developer/Vector.svg",
        "image": "/FE/assets/images/pages/blockchain_developer/content.svg",
        "seperator": "",
        "firsttitle": "Blockchain Developer là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia thiết kế, phát triển và triển khai các ứng dụng hoặc hệ thống dựa trên công nghệ Blockchain, bao gồm việc xây dựng smart contract, tạo và quản lý giao dịch phi tập trung, cũng như tích hợp blockchain vào sản phẩm phần mềm nhằm đảm bảo tính minh bạch và an toàn dữ liệu. <br>Mục tiêu cốt lõi: Xây dựng và duy trì các hệ thống phi tập trung (decentralized systems) có khả năng bảo mật cao, minh bạch, và chống giả mạo dữ liệu, qua đó tăng tính tin cậy, giảm phụ thuộc vào bên trung gian, và mở rộng khả năng ứng dụng blockchain trong các lĩnh vực như tài chính, chuỗi cung ứng, hay quản lý danh tính số.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "computer_vision_engineer",
        "title": "Computer Vision Engineer",
        "icon": "/FE/assets/images/pages/computer_vision_engineer/Vector.svg",
        "image": "/FE/assets/images/pages/computer_vision_engineer/content.svg",
        "seperator": "",
        "firsttitle": "Computer Vision Engineer là gì?",
        "firstdesc": "Định nghĩa:Là người phân tích nhu cầu của khách hàng hoặc người dùng, rồi chuyển những yêu cầu đó thành bản mô tả kỹ thuật rõ ràng để lập trình viên có thể hiểu và xây dựng hệ thống đúng như mong muốn. Họ giống như “người phiên dịch” giữa người dùng và kỹ sư phần mềm. <br>Mục tiêu cốt lõi:Đảm bảo phần mềm được thiết kế đúng mục đích, phù hợp với nhu cầu thực tế, và dễ triển khai – dễ bảo trì. Nói cách khác, họ giúp “xây đúng thứ cần xây”, chứ không chỉ “xây đúng cách”.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "technical_support_specialist",
        "title": "Technical Support Specialist",
        "icon": "/FE/assets/images/pages/technical_support_specialist/Vector.svg",
        "image": "/FE/assets/images/pages/technical_support_specialist/content.svg",
        "seperator": "",
        "firsttitle": "CTechnical Support Specialist là gì?",
        "firstdesc": "Định nghĩa: Là người hỗ trợ người dùng cuối giải quyết các vấn đề kỹ thuật liên quan đến phần mềm, phần cứng hoặc hệ thống mạng. Họ là cầu nối giữa người dùng và đội ngũ kỹ thuật, giúp đảm bảo sản phẩm hoặc dịch vụ công nghệ hoạt động trơn tru. <br>Mục tiêu cốt lõi:Giúp người dùng khắc phục sự cố nhanh chóng, sử dụng sản phẩm hiệu quả, đồng thời thu thập phản hồi về lỗi và trải nghiệm người dùng để nhóm phát triển cải tiến sản phẩm.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "database_administrator",
        "title": "Database Administrator",
        "icon": "/FE/assets/images/pages/database_administrator/Vector.svg",
        "image": "/FE/assets/images/pages/database_administrator/content.svg",
        "seperator": "",
        "firsttitle": "Database Administrator là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia chịu trách nhiệm cài đặt, cấu hình, quản lý, bảo trì và đảm bảo hiệu suất của các hệ thống cơ sở dữ liệu (Database Systems) của tổ chức. <br>Mục tiêu cốt lõi: Đảm bảo tính toàn vẹn, bảo mật và khả năng sẵn có (Availability) của dữ liệu. Thực hiện các quy trình sao lưu, phục hồi và tối ưu hóa truy vấn để hệ thống hoạt động nhanh và đáng tin cậy.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "technical_writer",
        "title": "Technical Writer",
        "icon": "/FE/assets/images/pages/technical_writer/Vector.svg",
        "image": "/FE/assets/images/pages/technical_writer/content.svg",
        "seperator": "",
        "firsttitle": "Technical Writer là gì?",
        "firstdesc": "Định nghĩa:Là người tạo và quản lý các tài liệu hướng dẫn, sổ tay, hướng dẫn sử dụng và tài liệu kỹ thuật liên quan đến phần mềm, phần cứng hoặc hệ thống, giúp người dùng và đội kỹ thuật hiểu và vận hành sản phẩm đúng cách. Mặc dù làm việc chủ yếu trong giai đoạn phát triển nhưng công việc của họ lại không quá liên quan đến việc lập trình. <br>Mục tiêu cốt lõi:Đảm bảo thông tin kỹ thuật được truyền đạt rõ ràng, chính xác và dễ hiểu, giúp người dùng sử dụng sản phẩm hiệu quả và giúp nhóm kỹ thuật giảm lỗi, tiết kiệm thời gian hỗ trợ.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "it_consultant",
        "title": "IT Consultant",
        "icon": "/FE/assets/images/pages/it_consultant/Vector.svg",
        "image": "/FE/assets/images/pages/it_consultant/content.svg",
        "seperator": "",
        "firsttitle": "IT Consultant là gì?",
        "firstdesc": "Định nghĩa: Là những chuyên gia được công ty thuê để phân tích các vấn đề kinh doanh (ví dụ: quy trình làm việc chậm, hệ thống cũ kỹ) và đưa ra lời khuyên (giải pháp). <br>Mục tiêu cốt lõi: Xác định chính xác vấn đề và đưa ra các giải pháp công nghệ tối ưu, giúp công ty đạt được mục tiêu kinh doanh (ví dụ: tăng doanh thu, giảm chi phí vận hành).Đảm bảo rằng việc đầu tư vào công nghệ là phù hợp và mang lại hiệu quả cho chiến lược kinh doanh tổng thể của khách hàng.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "chief_technology_officer",
        "title": "Chief Technology Officer (CTO)",
        "icon": "/FE/assets/images/pages/chief_technology_officer/Vector.svg",
        "image": "/FE/assets/images/pages/chief_technology_officer/content.svg",
        "seperator": "",
        "firsttitle": "CTO là gì?",
        "firstdesc": "CTO là người định hướng chiến lược công nghệ và kiến trúc hệ thống của công ty, đảm bảo công nghệ hỗ trợ mục tiêu kinh doanh và đổi mới sản phẩm. Khác với CIO, người tập trung vào hệ thống CNTT nội bộ và vận hành công nghệ, CTO hướng tới sản phẩm, R&D và đổi mới thị trường. <br>Mục tiêu cốt lõi:Đảm bảo công ty sử dụng công nghệ hiệu quả, sáng tạo và cạnh tranh, đồng thời hướng dẫn đội ngũ kỹ thuật phát triển sản phẩm và giải pháp phù hợp chiến lược doanh nghiệp.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "project_manager",
        "title": "Project Manager",
        "icon": "/FE/assets/images/pages/project_manager/Vector.svg",
        "image": "/FE/assets/images/pages/project_manager/content.svg",
        "seperator": "",
        "firsttitle": "Project Manager là gì?",
        "firstdesc": "Định nghĩa: Là vị trí quản lý quy trình và nguồn lực, chịu trách nhiệm lập kế hoạch, tổ chức, điều phối và kiểm soát toàn bộ quá trình thực hiện một dự án CNTT (ví dụ: xây dựng phần mềm, triển khai hệ thống). <br>Mục tiêu cốt lõi: Đảm bảo dự án được hoàn thành đúng phạm vi, trong ngân sách và đúng thời hạn đã được phê duyệt. Quản lý rủi ro và các bên liên quan để đạt được kết quả cuối cùng theo yêu cầu kinh doanh.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "system_administrator",
        "title": "System Administrator",
        "icon": "/FE/assets/images/pages/system_administrator/Vector.svg",
        "image": "/FE/assets/images/pages/system_administrator/content.svg",
        "seperator": "",
        "firsttitle": "System Administrator là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia chịu trách nhiệm cài đặt, cấu hình, vận hành và duy trì cơ sở hạ tầng CNTT trong toàn bộ vòng đời hệ thống, bao gồm máy chủ, hệ điều hành, mạng và các ứng dụng doanh nghiệp, đảm bảo hệ thống sẵn sàng, ổn định và bảo mật. <br>Mục tiêu cốt lõi:Đảm bảo tính sẵn sàng, hiệu suất và bảo mật của hệ thống , xử lý sự cố kịp thời và cung cấp hỗ trợ kỹ thuật liên tục để vận hành sản phẩm và quy trình kinh doanh không gián đoạn.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "network_engineer",
        "title": "Network Engineer",
        "icon": "/FE/assets/images/pages/network_engineer/Vector.svg",
        "image": "/FE/assets/images/pages/network_engineer/content.svg",
        "seperator": "",
        "firsttitle": "Network Engineer là gì?",
        "firstdesc": "Là chuyên gia chịu trách nhiệm thiết kế, triển khai, cấu hình và quản lý cơ sở hạ tầng mạng trong toàn bộ vòng đời hệ thống, bao gồm mạng có dây và không dây, đảm bảo kết nối ổn định, bảo mật và hiệu quả giữa người dùng, máy chủ và dịch vụ. <br>Mục tiêu cốt lõi:Đảm bảo hệ thống mạng hoạt động liên tục và tin cậy , hỗ trợ vận hành, phát triển và triển khai sản phẩm, đồng thời tăng hiệu suất và bảo mật cho toàn bộ cơ sở hạ tầng CNTT.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "chief_information_officer",
        "title": "Chief Information Officer (CIO) ",
        "icon": "/FE/assets/images/pages/chief_information_officer/Vector.svg",
        "image": "/FE/assets/images/pages/chief_information_officer/content.svg",
        "seperator": "",
        "firsttitle": "CIO là gì?",
        "firstdesc": "Định nghĩa: Là vị trí quản lý cấp cao chịu trách nhiệm về toàn bộ hệ thống và chiến lược công nghệ thông tin (IT) trong doanh nghiệp, đảm bảo các hệ thống CNTT vận hành ổn định, an toàn và hỗ trợ đầy đủ các quy trình kinh doanh trong suốt vòng đời phát triển phần mềm và hệ thống. <br>Mục tiêu cốt lõi:Dẫn dắt chuyển đổi số, giám sát, bảo trì và cải tiến liên tục hệ thống CNTT, tối ưu hóa việc sử dụng công nghệ để nâng cao hiệu quả vận hành, bảo mật và khả năng cạnh tranh của doanh nghiệp.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "systems_engineer",
        "title": "Systems Engineer",
        "icon": "/FE/assets/images/pages/systems_engineer/Vector.svg",
        "image": "/FE/assets/images/pages/systems_engineer/content.svg",
        "seperator": "",
        "firsttitle": "System Engineer là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia chịu trách nhiệm thiết kế, tích hợp và quản lý toàn bộ hệ thống phần mềm, phần cứng và mạng lưới trong tổ chức. Họ nhìn nhận dự án từ góc độ toàn cảnh. <br>Mục tiêu cốt lõi: Đảm bảo tất cả các thành phần kỹ thuật hoạt động cùng nhau một cách nhất quán, hiệu quả và đáp ứng các yêu cầu ở cấp độ hệ thống lớn, quản lý độ phức tạp và rủi ro xuyên suốt dự án.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "business_intelligence_analyst",
        "title": "Business Intelligence Analyst (BIA)",
        "icon": "/FE/assets/images/pages/business_intelligence_analyst/Vector.svg",
        "image": "/FE/assets/images/pages/business_intelligence_analyst/content.svg",
        "seperator": "",
        "firsttitle": "BIA là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia sử dụng các công cụ và kỹ thuật phân tích dữ liệu để xây dựng báo cáo (reports) và bảng điều khiển (dashboards), giúp tổ chức theo dõi hiệu suất và hiểu rõ xu hướng kinh doanh. <br>Mục tiêu cốt lõi: Chuyển đổi dữ liệu thô thành thông tin chi tiết (insights) hành động được, hỗ trợ các nhà quản lý trong việc đánh giá tình hình hiện tại và đưa ra các quyết định chiến lược hoặc điều chỉnh kịp thời.",
        "secondtitle": "",
        "seconddesc": ""
    },
    {
        "id": "qa_analyst",
        "title": "QA Analyst",
        "icon": "/FE/assets/images/pages/qa_analyst/Vector.svg",
        "image": "/FE/assets/images/pages/qa_analyst/content.svg",
        "seperator": "",
        "firsttitle": "QA Analyst là gì?",
        "firstdesc": "Định nghĩa: Là chuyên gia thực hiện các hoạt động kiểm thử theo kế hoạch (ví dụ: kiểm thử chức năng, kiểm thử hồi quy) để tìm ra lỗi (bugs) và các vấn đề về chất lượng trong sản phẩm phần mềm. <br>Mục tiêu cốt lõi: Đảm bảo sản phẩm hoạt động đúng theo yêu cầu thiết kế và đạt được mức độ chất lượng chấp nhận được trước khi phát hành, qua đó giảm thiểu rủi ro và tăng sự tin cậy của người dùng.",
        "secondtitle": "",
        "seconddesc": ""
    }   
]